namespace Trcont.Cud.Domain.Enum
{
    public enum FactSourceEnum
    {
        /// <summary>
        /// _05.1. Акты морских и речных портов /хранение в порту погрузки/
        /// </summary>
        Doc1 = 304666,

        /// <summary>
        /// _18.1. Ведомости ГУ-46 при отправлении
        /// </summary>
        Doc2 = 304667,

        /// <summary>
        /// _04.1. Акты морских и речных портов /доп. услуги в портах погрузки/
        /// </summary>
        Doc3 = 304668,

        /// <summary>
        /// _02.1. Акты контейнерного терминала /хранение контейнеров при отправлении/
        /// </summary>
        Doc4 = 304669,

        /// <summary>
        /// _14.1. Товарно-транспортные накладные по отправлению
        /// </summary>
        Doc5 = 304670,

        /// <summary>
        /// 08. Отчёт агента
        /// </summary>
        Doc6 = 304671,

        /// <summary>
        /// _10. Коносаменты морские
        /// </summary>
        Doc7 = 304672,

        /// <summary>
        /// _13. Отчёт декларанта
        /// </summary>
        Doc8 = 304673,

        /// <summary>
        /// 07. Акты соисполнителей
        /// </summary>
        Doc9 = 304676,

        /// <summary>
        /// _03.1. Акты контейнерного терминала /хранение на СВХ при отправлении/
        /// </summary>
        Doc10 = 304678,

        /// <summary>
        /// _01.1. Акты контейнерного терминала /хранение грузов при отправлении/
        /// </summary>
        Doc11 = 304679,

        /// <summary>
        /// 01. Акты приёма-передачи
        /// </summary>
        Doc12 = 304683,

        /// <summary>
        /// _09. Железнодорожные накладные (по СНГ и третьим странам)
        /// </summary>
        Doc13 = 304685,

        /// <summary>
        /// 04. Железнодорожные накладные
        /// </summary>
        Doc14 = 304686,

        /// <summary>
        /// _11. Коносаменты речные
        /// </summary>
        Doc15 = 617935,

        /// <summary>
        /// 02. Документ отчёта
        /// </summary>
        Doc16 = 617936,

        /// <summary>
        /// _15.2. Наряд КЭУ-16 по прибытию
        /// </summary>
        Doc17 = 617937,

        /// <summary>
        /// _15.1. Наряд КЭУ-16 при отправлении
        /// </summary>
        Doc18 = 617940,

        /// <summary>
        /// _16. Учетная карточка
        /// </summary>
        Doc19 = 617941,

        /// <summary>
        /// _05.2. Акты морских и речных портов /хранение в порту выгрузки/
        /// </summary>
        Doc20 = 617942,

        /// <summary>
        /// _04.2. Акты морских и речных портов /доп. услуги в портах выгрузки/
        /// </summary>
        Doc21 = 617943,

        /// <summary>
        /// _02.2. Акты контейнерного терминала /хранение контейнеров по прибытию/
        /// </summary>
        Doc22 = 617944,

        /// <summary>
        /// _14.2. Товарно-транспортные накладные по прибытию
        /// </summary>
        Doc23 = 617945,

        /// <summary>
        /// _18.2. Ведомости ГУ-46 по прибытию
        /// </summary>
        Doc24 = 617946,

        /// <summary>
        /// 03. Накопительная карточка
        /// </summary>
        Doc25 = 1503245,

        /// <summary>
        /// _01.2. Акты контейнерного терминала /хранение грузов по прибытию/
        /// </summary>
        Doc26 = 1503862,

        /// <summary>
        /// _14.3. Товарно-транспортные накладные в пути следования
        /// </summary>
        Doc27 = 41358685,

        /// <summary>
        /// UNKNOWN
        /// </summary>
        Doc28 = 55862114,

        /// <summary>
        /// 05. Коносамент
        /// </summary>
        Doc29 = 55862116,

        /// <summary>
        /// 06. Транспортная накладная
        /// </summary>
        Doc30 = 55862117,

        /// <summary>
        /// 09. Декларация о взвешивании/Акт о взвешивании
        /// </summary>
        Doc31 = 55862120,

        /// <summary>
        /// 10. КЭУ-16
        /// </summary>
        Doc32 = 55862121
    }
}
